<?php #แสดงค่าอายุปีของนักกีฬาวิ่งแต่ละคน
$birthYear = ("2547"); #เปลี่ยนปีพศของนักกีฬา
$currentYear = date("Y")+543; #กำหนดค่า ปีปัจจุบันตามโจทย์
$total = $currentYear - $birthYear; #ปีปัจจุบัน ลบด้วยปีเกิด
echo "คุณอายุ $total ปี<br>";
if ($total < "20") { #ถ้ามีอายุ น้อยกว่า 20
    echo "อายุต่ำกว่า 20 ปี"; #ให้แสดงว่า อายุต่ำกว่า 20 ปี
}   elseif ($total < "31") { #ถ้ามีอายุ น้อยกว่า 31
    echo "อายุ 20 ปีขึ้นไป แต่ไม่เกิน 30 ปี"; #ใอายุ 20 ปีขึ้นไป แต่ไม่เกิน 30 ปี
} else { #นอกเหนือจากนี้ให้แสดง ไม่จำกัดอายุ
    echo "ไม่จำกัดอายุ";
}
?>